src/cf/InformationRegisters/ОсновныеКонтактныеЛицаКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОсновныеКонтактныеЛицаКонтрагентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОсновныеКонтактныеЛицаКонтрагентов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает основное контактное лицо контрагента
// 
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты
//
// Возвращаемое значение:
//  СправочникСсылка.КонтактныеЛица
// 
Функция ОсновноеКонтактноеЛицоКонтрагента(Контрагент) Экспорт
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Справочники.КонтактныеЛица.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОсновныеКонтактныеЛицаКонтрагентов.КонтактноеЛицо
		|ИЗ
		|	РегистрСведений.ОсновныеКонтактныеЛицаКонтрагентов КАК ОсновныеКонтактныеЛицаКонтрагентов
		|ГДЕ
		|	ОсновныеКонтактныеЛицаКонтрагентов.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КонтактноеЛицо;
	КонецЕсли;
	
	Возврат Справочники.КонтактныеЛица.ПустаяСсылка();
	
КонецФункции

// Устанавливает основное контактное лицо контрагента
// 
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты
//  КонтактноеЛицо - СправочникСсылка.КонтактныеЛица
// 
Процедура УстановитьОсновноеКонтактноеЛицоКонтрагента(Контрагент, КонтактноеЛицо) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Контрагент = Контрагент;
	МенеджерЗаписи.КонтактноеЛицо = КонтактноеЛицо;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Снимает отметку основного контактного лица контрагента
// 
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты
// 
Процедура СнятьОтметкуОсновногоКонтактногоЛицаКонтрагента(Контрагент) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Контрагент = Контрагент;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
